Open-CMSIS-Pack/pack-examples/STM32U5xx_DFP/CMSIS/Driver/SPI_STM32U5xx.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2021-2023 Arm Limited (or its affiliates).
 * All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 *
 * $Date:        10. March 2023
 * $Revision:    V1.1
 *
 * Driver:       Driver_SPI1/2/3
 *
 * Configured:   via CubeMX
 * Project:      SPI Driver for STMicroelectronics STM32U5xx
 * -------------------------------------------------------------------------- */

/*! \page stm32u5_spi SPI

# Revision History

- Version 1.1
  - Updated Receive function to properly support Default Tx Value transmission during reception
    (due to STM32 HAL changed functionality)
  - Corrected Control function to support more than 8 data bits in DMA mode
  - Corrected GetDataCount function in DMA mode
- Version 1.0
  - Initial release

# Capabilities

This driver supports **Master** and **Slave** modes.

# Instances

Hardware resource relating to driver instance is shown in the table below:

Driver Instance | Hardware Resource
:---------------|:-----------------:
Driver_SPI1     | SPI1
Driver_SPI2     | SPI2
Driver_SPI3     | SPI3

# Limitations

Hardware limitations:
 - Number of items to send, receive or transmit for SPI3 is limited to 1023

STM32 HAL limitations:
 - Number of items to send, receive or transmit is limited to 65535
 - Mode Fault and Data Lost events can be detected only when reception is active
 - Settings changes using Control function activate upon send/receive/transfer operation start

\note If SPI driver is used in IRQ mode, ensure that it has higher priority then
      any IRQ routine requiring longer processing time, because such IRQ routine
      can prevent SPI IRQ routine to correctly handle reception thus fail to
      receive all data correctly or fail to generate ARM_SPI_EVENT_TRANSFER_COMPLETE
      event.
\note The previous limitation can also be avoided by using SPI driver in DMA mode.

# Configuration

## STM32CubeMX

The SPI driver requires:
  - **SPI peripheral clock**
  - **SPI** peripheral configured as **Full-Duplex Master/Slave**
  - **SPI MISO, MOSI, SCK** and **NSS pins**
  - optional **DMA** configuration for transfers

# B-U585I-IOT02A Board Configuration

These settings are relevant for this board, for different board please refer to the board
schematic for proper configuration.

Link to [B-U585I-IOT02A board schematic](https://www.st.com/resource/en/schematic_pack/mb1551-u585i-c02_schematic.pdf).

## STM32CubeMX

Required peripherals for the **B-U585I-IOT02A** board are listed in the table below:

Peripheral | Mode                         | Description
:---------:|:----------------------------:|:-----------
SPI1       | Full-Duplex Master           | SPI1 Controller
PE12       | Alternate Function Push Pull | SPI1 NSS Pin
PE13       | Alternate Function Push Pull | SPI1 SCK Pin
PE14       | Alternate Function Push Pull | SPI1 MISO Pin
PE15       | Alternate Function Push Pull | SPI1 MOSI Pin

\note All settings have to be configured as described in the procedure below. Important settings,
      typically the ones different from default, are emphasized in **bold**.

### Pinout & Configuration tab

  1. In the **Pinout view** window click on a pin and select it's functionality:
        Pin      | Functionality
        :--------|:-------------:
        PE12     | **SPI1_NSS**
        PE13     | **SPI1_SCK**
        PE14     | **SPI1_MISO**
        PE15     | **SPI1_MOSI**
       \n

  2. Under **Categories**: **Connectivity** select **SPI1**:

     __Mode__:
       - Mode: **Full-Duplex Master**
       - Hardware NSS Signal: **Hardware NSS Output Signal**
       - Hardware RDY Signal: Disable

     __Configuration__:
       - Parameter Settings: not used
       - User Constants: not used
       - NVIC Settings: configured in later step (under Category: System Core: NVIC)
       - DMA Settings: configured in later step (under Category: System Core: GPDMA1)
       - GPIO Settings:
            Pin Name | Signal on Pin | Pin Context..| Pin Priv..| GPIO output..| GPIO mode                     | GPIO Pull-up/Pull..| Maximum out..| Fast Mode | User Label
            :--------|:-------------:|:------------:|:---------:|:------------:|:-----------------------------:|:------------------:|:------------:|:---------:|:----------:
            PE12     | SPI1_NSS      | n/a          | n/a       | n/a          | Alternate Function Push Pull  | No pull-up and no..| **Medium**   | n/a       | .
            PE13     | SPI1_SCK      | n/a          | n/a       | n/a          | Alternate Function Push Pull  | No pull-up and no..| **Medium**   | n/a       | .
            PE14     | SPI1_MISO     | n/a          | n/a       | n/a          | Alternate Function Push Pull  | No pull-up and no..| **Medium**   | n/a       | .
            PE15     | SPI1_MOSI     | n/a          | n/a       | n/a          | Alternate Function Push Pull  | No pull-up and no..| **Medium**   | n/a       | .
       \n

  3. Under **Categories**: **System Core** select **GPDMA1**:

     __Mode__:
       - Channel 0 - 2 Words Internal FIFO: **Standard Request Mode**
       - Channel 1 - 2 Words Internal FIFO: **Standard Request Mode**

     __Configuration__:
       - All Channels: not used
       - Security:
         - CH1:
           - Enable Channel as Privileged: NON PRIVILEGED
         - CH0:
           - Enable Channel as Privileged: NON PRIVILEGED
       - CH0:
         - Circular configuration:
           - Circular Mode: Disable
         - Request Configuration:
           - Request: **SPI1_TX**
           - DMA Handle in IP Structure: hdmatx
           - Block HW request protocol: Single/Burst Level
         - Channel configuration:
           - Priority: Low
           - Transaction Mode: Normal
           - Direction: **Memory to Peripheral**
         - Source Data Setting:
           - Source Address Increment After Transfer: **Enabled**
           - Data Width: Byte
           - Burst Length: 1
           - Allocated Port for Transfer: Port 0
         - Destination Data Setting:
           - Destination Address Increment After Transfer: **Disabled**
           - Data Width: Byte
           - Burst Length: 1
           - Allocated Port for Transfer: Port 0
         - Data Handling:
           - Data Handling Configuration: Disable
         - Trigger:
           - Trigger Configuration: Disable
         - Transfer Event Configuration:
           - Transfer Event Generation: The TC (and the HT) ...
       - CH1:
         - Circular configuration:
           - Circular Mode: Disable
         - Request Configuration:
           - Request: **SPI1_RX**
           - DMA Handle in IP Structure: hdmarx
           - Block HW request protocol: Single/Burst Level
         - Channel configuration:
           - Priority: Low
           - Transaction Mode: Normal
           - Direction: **Peripheral to Memory**
         - Source Data Setting:
           - Source Address Increment After Transfer: **Disabled**
           - Data Width: Byte
           - Burst Length: 1
           - Allocated Port for Transfer: **Port 1**
         - Destination Data Setting:
           - Destination Address Increment After Transfer: **Enabled**
           - Data Width: Byte
           - Burst Length: 1
           - Allocated Port for Transfer: **Port 1**
         - Data Handling:
           - Data Handling Configuration: Disable
         - Trigger:
           - Trigger Configuration: Disable
         - Transfer Event Configuration:
           - Transfer Event Generation: The TC (and the HT) ...
       - User Constants: not used
       \n\n

